chenyurong22/STM32-EC200-Firmware/src/modem.c
static void run_protection(void)
{
    static bool prev_r1_running = false;
    static bool prev_r2_running = false;

    float v1 = Sensor_ReadVoltagePhase1();
    float v2 = Sensor_ReadVoltagePhase2();
    float v3 = Sensor_ReadVoltagePhase3();
    float i = Sensor_ReadCurrentACS712();

    bool ov = (v1 > cfg_ov || v2 > cfg_ov || v3 > cfg_ov);
    bool uv = (v1 < cfg_uv || v2 < cfg_uv || v3 < cfg_uv);
    bool pl = (v1 < cfg_pl || v2 < cfg_pl || v3 < cfg_pl);

    /* Startup grace windows — computed once, reused for both voltage and dry-run suppression.
     * During the grace window UV+PL are ignored: motor inrush can briefly dip the supply.
     * OV protection stays active at all times (overvoltage during startup is dangerous). */
    bool relay1_in_startup = relay1_on_tick &&
        (HAL_GetTick() - relay1_on_tick < (uint32_t)cfg_start_t * 1000U);
    bool relay2_in_startup = relay2_on_tick &&
        (HAL_GetTick() - relay2_on_tick < (uint32_t)cfg_start_t2 * 1000U);

    /* OV always trips.  UV+PL only trip once the startup grace window has expired. */
    bool volt_trip1 = ov || (!relay1_in_startup && (uv || pl));
    bool volt_trip2 = ov || (!relay2_in_startup && (uv || pl));

    if (volt_trip1 && relay1)
    {
        Relay1_Set(false);
        log_relay_event(1, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert(ov, uv, pl, false);
        volt_alert_sent1 = true;
        Debug_Print("[PROT] Voltage fault — pump1 OFF\r\n");
    }

    if (volt_trip2 && relay2)
    {
        Relay2_Set(false);
        log_relay_event(2, false, ov ? "overvoltage" : (uv ? "undervoltage" : "phase_loss"));
        publish_alert2(ov, uv, pl, false);
        volt_alert_sent2 = true;
        Debug_Print("[PROT] Voltage fault — pump2 OFF\r\n");
    }

    if ((ov || uv || pl) && (relay1 || relay2))
        return;

    /* Voltage OK — clear any outstanding voltage fault alert in Firebase */
    if (!ov && !uv && !pl)
    {
        if (volt_alert_sent1) {
            volt_alert_sent1 = false;
            publish_alert(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump1 alert reset\r\n");
        }
        if (volt_alert_sent2) {
            volt_alert_sent2 = false;
            publish_alert2(false, false, false, false);
            Debug_Print("[PROT] Voltage fault cleared — pump2 alert reset\r\n");
        }
    }

    /* relay1_in_startup already computed above (shared grace window for voltage + dry-run) */
    if (relay1_in_startup)
    {
        dry_run_count = 0; /* keep counter clear during startup grace */
    }
    else if (relay1 && !dry_run_tripped && cfg_dry_en)
    {
        if (i < cfg_dry_i)
        {
            dry_run_count++;
            if (dry_run_count >= (uint8_t)cfg_dry_t)
            {
                dry_run_tripped = true;
                lockout_until = HAL_GetTick() + LOCKOUT_MS;
                Relay1_Set(false);
                log_relay_event(1, false, "dry_run");
                publish_alert(false, false, false, true);
                Debug_Print("[PROT] Dry run — pump OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count = 0;
        }
    }

    if (dry_run_tripped && HAL_GetTick() >= lockout_until)
    {
        dry_run_tripped = false;
        dry_run_count = 0;
        publish_alert(false, false, false, false);
        Debug_Print("[PROT] Lockout cleared\r\n");
    }

    /* ── Relay2 dry run protection ─────────────────────────────────────── */
    /* relay2_in_startup already computed above (shared grace window for voltage + dry-run) */
    if (relay2_in_startup)
    {
        dry_run_count2 = 0;
    }
    else if (relay2 && !dry_run_tripped2 && cfg_dry_en2)
    {
        if (i < cfg_dry_i2)
        {
            dry_run_count2++;
            if (dry_run_count2 >= (uint8_t)cfg_dry_t2)
            {
                dry_run_tripped2 = true;
                lockout_until2 = HAL_GetTick() + LOCKOUT_MS;
                Relay2_Set(false);
                log_relay_event(2, false, "dry_run");
                publish_alert2(false, false, false, true);
                Debug_Print("[PROT] Dry run2 — pump2 OFF + lockout\r\n");
            }
        }
        else
        {
            dry_run_count2 = 0;
        }
    }

    if (dry_run_tripped2 && HAL_GetTick() >= lockout_until2)
    {
        dry_run_tripped2 = false;
        dry_run_count2 = 0;
        publish_alert2(false, false, false, false);
        Debug_Print("[PROT] Lockout2 cleared\r\n");
    }

    /* Publish immediately when running state changes (relay ON + current confirmed).
     * Without this, STARTING→RUNNING transition waits up to 10s for next heartbeat.
     * run_protection fires every 1s; Modbus updates every 2s — transition seen within 3s. */
    bool data_ok   = Modbus_IsDataValid();
    bool r1_running = relay1 && data_ok && (i > cfg_dry_i);
    bool r2_running = relay2 && data_ok && (i > cfg_dry_i2); /* relay2 uses its own threshold */

    /* Capture the first moment current is detected — used for accurate run_s in logs.
     * run_s = time from here to relay OFF, excluding soft-starter delay. */
    if (r1_running && !running1_start_tick) running1_start_tick = HAL_GetTick();
    if (r2_running && !running2_start_tick) running2_start_tick = HAL_GetTick();

    if (r1_running != prev_r1_running)
    {
        prev_r1_running = r1_running;
        publish_status();
    }
    if (r2_running != prev_r2_running)
    {
        prev_r2_running = r2_running;
        publish_status2();
    }
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON field extractor  — extracts integer value for a key
 * e.g. extract_int("{\"relay1\":1,\"relay2\":0}", "relay1") → 1
 * ═══════════════════════════════════════════════════════════════════════════ */

static int extract_int(const char *json, const char *key)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p)
        return -1;
    p += strlen(search);
    while (*p == ' ')
        p++;
    return atoi(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON float field extractor — returns float value for key, or def if missing
 * ═══════════════════════════════════════════════════════════════════════════ */

/* Lightweight float parser — avoids newlib strtod() bloat (~15 KB).
 * Handles formats like "1.5", "480", "-2.3". */
static float parse_float_lite(const char *s)
{
    while (*s == ' ') s++;
    float sign = 1.0f;
    if (*s == '-') { sign = -1.0f; s++; }
    float result = 0.0f;
    while (*s >= '0' && *s <= '9') { result = result * 10.0f + (*s++ - '0'); }
    if (*s == '.') {
        s++;
        float frac = 0.1f;
        while (*s >= '0' && *s <= '9') { result += (*s++ - '0') * frac; frac *= 0.1f; }
    }
    return sign * result;
}

static float extract_float(const char *json, const char *key, float def)
{
    char search[32];
    snprintf(search, sizeof(search), "\"%s\":", key);
    const char *p = strstr(json, search);
    if (!p) return def;
    p += strlen(search);
    while (*p == ' ') p++;
    return parse_float_lite(p);
}

/* ═══════════════════════════════════════════════════════════════════════════
 * JSON string field extractor — copies value of "key":"<value>" into out
 * Returns true if key was found and value is non-empty.
 * ═══════════════════════════════════════════════════════════════════════════ */

