chenyurong22/STM32-EC200-Firmware/src/modem.c
    /* Re-apply SSL context 0 AFTER QMTCLOSE+QIDEACT.
     * AT+QMTCLOSE reloads NVM MQTT config which may reset QSSLCFG context 0
     * settings (seclevel, ciphersuite, SNI) back to factory defaults.
     * Placing these here guarantees they are set correctly regardless of any
     * NVM reload, and they survive until AT+QMTOPEN is called.              */
    modem_cmd("AT+QSSLCFG=\"sslversion\",0,4");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"ciphersuite\",0,0xFFFF");
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"seclevel\",0,0");   /* no cert verify — EMQX self-signed */
    HAL_Delay(300);
    modem_cmd("AT+QSSLCFG=\"sni\",0,\"" BROKER_HOST "\"");
    HAL_Delay(300);
    IWDG->KR = 0xAAAAU;   /* pet: 4×300 ms = 1.2 s since last pet              */

    /* Configure MQTT client AFTER QMTCLOSE so NVM reload can't undo these.  */
    modem_cmd("AT+QMTCFG=\"ssl\",0,1,0");       /* MQTT client 0 → SSL context 0  */
    HAL_Delay(300);
    /* EC200U NVM default is MQTT 3.1 (version=3) which omits credentials from
     * the CONNECT packet — broker sees anonymous → CONNACK=5.
     * Must explicitly set version=4 (MQTT 3.1.1) AFTER every QMTCLOSE.     */
    modem_cmd("AT+QMTCFG=\"version\",0,4");     /* MQTT 3.1.1 — sends credentials */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"pdpcid\",0,1");      /* bind to PDP context 1          */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"keepalive\",0,300"); /* keepalive 300 s — survives OTA */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"session\",0,1");     /* clean session                  */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"will\",0,0");        /* disable Will — no stale topic  */
    HAL_Delay(300);
    modem_cmd("AT+QMTCFG=\"recv/mode\",0,1,1"); /* direct push + full payload URC */
    HAL_Delay(300);

    /* Wire up OTA send/publish callbacks so ota.c can issue AT commands
     * and publish MQTT status without a circular header dependency.         */
    OTA_Init();
    OTA_SetSendFn(Modem_Send);
    OTA_SetPublishFn(modem_ota_publish);

    /* PDP is now deactivated (modem_sync_expect confirmed OK above).
     * Use the same NET_WAIT path for both cold boot and OTA reboot.
     * NET_WAIT polls CEREG until LTE is registered, then NET_WAIT→PDP_OPEN
     * sends QICSGP to configure the APN — QIACT=1 requires a valid APN
     * context configuration even after a previous QIDEACT.              */
    if (ota_reboot)
        Debug_Print("[MODEM] OTA reboot — PDP deactivated, going to NET_WAIT\r\n");
    mqtt_state       = MQTT_STATE_NET_WAIT;
    state_entered_ms = HAL_GetTick();
    /* Suppress modem_reinit for 20 s after init — late EC200U boot URCs
     * (APP RDY, +CFUN: 1) that arrive during the config phase must not
     * re-trigger a full Modem_Init unnecessarily.                       */
    modem_init_grace_until = HAL_GetTick() + 20000UL;
    modem_cmd("AT+CEREG?");
}

/* ═══════════════════════════════════════════════════════════════════════════
 * Modem_Process  — called every loop iteration from main.c
 * ═══════════════════════════════════════════════════════════════════════════ */

void Modem_Process(void)
{
    if (!modem_uart)
        return;

    /* Keep feeding watchdog even when no UART data arrives. */
    HAL_IWDG_Refresh(&hiwdg);

    /* ── read bytes from EC200U into line buffer ── */
    /* Direct hardware register read — same approach as Modbus RX.
     * Bypasses HAL lock/unlock overhead (~6 µs per call) so the main loop
     * runs at <1 µs/iteration, fast enough to read USART2 Modbus bytes
     * (one every 1040 µs at 9600 baud) without overrun.                  */
    uint8_t c;
    static uint8_t ota_connect_match = 0;
    static bool ota_skip_to_lf = false;
    static uint16_t ota_rx_pet = 0;
    for (;;) {
        uint32_t isr1 = modem_uart->Instance->ISR;
        if (isr1 & (USART_ISR_ORE | USART_ISR_FE | USART_ISR_NE)) {
            modem_uart->Instance->ICR = USART_ICR_ORECF | USART_ICR_FECF | USART_ICR_NECF;
            modem_uart->ErrorCode = HAL_UART_ERROR_NONE;
        }
        if (!(isr1 & USART_ISR_RXNE_RXFNE)) break;
        c = (uint8_t)(modem_uart->Instance->RDR & 0xFF);
        if (++ota_rx_pet >= 64U) { HAL_IWDG_Refresh(&hiwdg); ota_rx_pet = 0; }

        /* Detect prompt-style CONNECT from AT+QHTTPREAD that may arrive without
         * a clean line break. */
        if (OTA_ExpectingHttpReadConnect()) {
            static const char token[] = "CONNECT";
            if (c == (uint8_t)token[ota_connect_match]) {
                ota_connect_match++;
                if (ota_connect_match >= (sizeof(token) - 1U)) {
                    ota_connect_match = 0;
                    ota_skip_to_lf = true;
                    OTA_HandleLine("CONNECT");
                }
                continue;
            }
            ota_connect_match = (c == (uint8_t)token[0]) ? 1U : 0U;
            /* While waiting for CONNECT, keep bytes isolated from line parser. */
            continue;
        } else {
            ota_connect_match = 0;
        }

        /* Drop trailing CONNECT line ending before passing binary bytes to OTA. */
        if (ota_skip_to_lf) {
            if (c == '\n') {
                ota_skip_to_lf = false;
            }
            continue;
        }

        /* OTA binary passthrough — raw bytes from AT+QFREAD/QHTTPREAD */
        if (OTA_BinaryPending()) {
            OTA_FeedByte(c);
            continue;
        }

        if (c == '\r')
            continue;

        /* '>' is the publish prompt — not followed by '\n', catch it here */
                if (c == '>')
        {
            if (mqtt_state == MQTT_STATE_PUBLISHING && pub_pending)
            {
                /* Send payload immediately � any blocking delay here risks
                 * the modem aborting the input window.                     */
                HAL_UART_Transmit(modem_uart,
                                  (uint8_t *)pub_payload, strlen(pub_payload), 3000);
                /* Ctrl-Z commits the message */
                uint8_t ctrlz = 0x1A;
                HAL_UART_Transmit(modem_uart, &ctrlz, 1, 1000);
                mqtt_state = MQTT_STATE_PUB_WAIT_OK;
                state_entered_ms = HAL_GetTick();
            }
            rxpos = 0;
            continue;
        }

        if (c == '\n')
        {
            rxbuf[rxpos] = '\0';
            if (rxpos > 0)
                process_line(rxbuf);
            rxpos = 0;
        }
        else
        {
            if (rxpos < RX_BUF_SIZE - 1)
                rxbuf[rxpos++] = (char)c;
            else
                rxpos = 0; /* overflow guard */
        }
    }

    /* Full modem reset recovery path: re-run Modem_Init so SSL/MQTT config
     * is restored before attempting any reconnect. */
    if (modem_reinit_pending && !OTA_IsActive()) {
        modem_reinit_pending = false;
        recv_payload_pending = false;
        pub_pending = false;
        OTA_Init();
        Modem_Init(modem_uart);
        return;
    }

    /* ── send AT+QIACT=1 after buffer is drained (avoids stale QMTCLOSE/QIDEACT OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_ACTIVATE && !qiact_sent)
    {
        qiact_sent = true;
        modem_cmd("AT+QIACT=1");
    }

    /* ── send AT+QICSGP after buffer is drained (avoids spurious CGREG OK) ── */
    if (mqtt_state == MQTT_STATE_PDP_OPEN && !qicsgp_sent)
    {
        qicsgp_sent = true;
        char apn_cmd[80];
        snprintf(apn_cmd, sizeof(apn_cmd),
                 "AT+QICSGP=1,1,\"%s\",\"\",\"\",0", SIM_APN);
        modem_cmd(apn_cmd);
    }

    /* ── BOOT heartbeat: keep probing modem until first RDY/OK is seen ── */
    if (mqtt_state == MQTT_STATE_BOOT &&
        (HAL_GetTick() - state_entered_ms) > 3000U)
    {
        Debug_Print("[MODEM] BOOT probe: AT\r\n");
        modem_cmd("AT");
        state_entered_ms = HAL_GetTick();
    }

    /* ── BROKER_OPEN / CONNECTING / SUBSCRIBING timeouts → reconnect ── */
    if ((mqtt_state == MQTT_STATE_BROKER_OPEN ||
         mqtt_state == MQTT_STATE_CONNECTING  ||
         mqtt_state == MQTT_STATE_SUBSCRIBING) &&
        HAL_GetTick() - state_entered_ms > 30000)
    {
        Debug_Print("[MQTT] Connection timeout — reconnecting\r\n");
        if (mqtt_state == MQTT_STATE_BROKER_OPEN) blink_n(1); /* 1 blink = BROKER_OPEN timed out */
        mqtt_state = MQTT_STATE_DISCONNECTED;
    }

